IRP/src/Documents/VendorsAdvancesClosing/VendorsAdvancesClosing.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
 <name>VendorsAdvancesClosing</name>
 <registerRecords>AccumulationRegister.TM1030B_TransactionsKey</registerRecords>
 <registerRecords>InformationRegister.T2013S_OffsetOfAging</registerRecords>
 <registerRecords>InformationRegister.T2010S_OffsetOfAdvances</registerRecords>
 <registerRecords>AccumulationRegister.TM1020B_AdvancesKey</registerRecords>
 <registerRecords>InformationRegister.DELETE_T2012S_AdvancesCurrencyRevaluation</registerRecords>
 <registerRecords>InformationRegister.PostedDocumentsRegistry</registerRecords>
 <registerRecords>InformationRegister.DELETE_T2011S_TransactionsCurrencyRevaluation</registerRecords>
 <attributes>
  <name>Company</name>
  <type>
   <types>CatalogRef.Companies</types>
  </type>
 </attributes>
 <attributes>
  <name>BeginOfPeriod</name>
  <type>
   <types>Date</types>
   <dateQualifiers>
    <dateFractions>Date</dateFractions>
   </dateQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>EndOfPeriod</name>
  <type>
   <types>Date</types>
   <dateQualifiers>
    <dateFractions>Date</dateFractions>
   </dateQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>DELETE_DontWriteNegativeDebtAsAdvance</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <attributes>
  <name>DontOffsetEmptyProjects</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
</mdclass:Document>

IRP/src/InformationRegisters/T2018S_FixedOffsetOfAdvances/T2018S_FixedOffsetOfAdvances.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
 <name>T2018S_FixedOffsetOfAdvances</name>
 <resources>
  <name>Amount</name>
  <type>
   <types>DefinedType.typeAmount</types>
  </type>
 </resources>
 <dimensions>
  <name>Document</name>
  <type>
   <types>DocumentRef.VendorsAdvancesClosing</types>
   <types>DocumentRef.CustomersAdvancesClosing</types>
  </type>
 </dimensions>
 <dimensions>
  <name>IsFixed</name>
  <type>
   <types>Boolean</types>
  </type>
 </dimensions>
 <dimensions>
  <name>Company</name>
  <type>
   <types>CatalogRef.Companies</types>
  </type>
 </dimensions>
 <dimensions>
  <name>Branch</name>
  <type>
   <types>CatalogRef.BusinessUnits</types>
  </type>
 </dimensions>
 <dimensions>
  <name>Currency</name>
  <type>
   <types>CatalogRef.Currencies</types>
  </type>
 </dimensions>
 <dimensions>
  <name>Partner</name>
  <type>
   <types>CatalogRef.Partners</types>
  </type>
 </dimensions>
 <dimensions>
  <name>LegalName</name>
  <type>
   <types>CatalogRef.Companies</types>
  </type>
 </dimensions>
 <dimensions>
  <name>Agreement</name>
  <type>
   <types>CatalogRef.Agreements</types>
  </type>
 </dimensions>
 <dimensions>
  <name>Order</name>
  <type>
   <types>DocumentRef.PurchaseOrder</types>
   <types>DocumentRef.SalesOrder</types>
  </type>
 </dimensions>
 <dimensions>
  <name>Project</name>
  <type>
   <types>CatalogRef.Projects</types>
  </type>
 </dimensions>
 <dimensions>
  <name>TransactionDocument</name>
  <type>
   <types>DocumentRef.SalesReportFromTradeAgent</types>
   <types>DocumentRef.CashTransferOrder</types>
   <types>DocumentRef.PurchaseInvoice</types>
   <types>DocumentRef.DebitNote</types>
   <types>DocumentRef.CreditNote</types>
   <types>DocumentRef.PurchaseReturn</types>
   <types>DocumentRef.OpeningEntry</types>
   <types>DocumentRef.SalesReturn</types>
   <types>DocumentRef.SalesReportToConsignor</types>
   <types>DocumentRef.SalesInvoice</types>
  </type>
 </dimensions>
</mdclass:InformationRegister>

IRP/src/Enums/AgreementKinds/AgreementKinds.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
 <name>AgreementKinds</name>
 <enumValues>
  <name>Regular</name>
 </enumValues>
 <enumValues>
  <name>Standard</name>
 </enumValues>
</mdclass:Enum>

IRP/src/Documents/VendorsAdvancesClosing/Forms/DocumentForm/Module.bsl
&AtServer
Procedure OnReadAtServer(CurrentObject)
	FillFixedOffsetOfAdvances(CurrentObject.Ref);
EndProcedure

&AtClient
Procedure BeforeWrite(Cancel, WriteParameters)
	SaveFixedOffsetAtServer();	
EndProcedure

&AtServer
Procedure AfterWriteAtServer(CurrentObject, WriteParameters)
	FillFixedOffsetOfAdvances(CurrentObject.Ref);
EndProcedure

&AtClient
Procedure SaveFixedOffset(Command)
	SaveFixedOffsetAtServer();
EndProcedure

&AtServer
Procedure SaveFixedOffsetAtServer()
	RecordSet = InformationRegisters.T2018S_FixedOffsetOfAdvances.CreateRecordSet();
	RecordSet.Filter.Document.Set(Object.Ref);
	For Each Row In ThisObject.FixedOffsetOfAdvances Do
		FillPropertyValues(RecordSet.Add(), Row);
	EndDo;
	RecordSet.Write();
EndProcedure

&AtClient
Procedure UncheckAll(Command)
	For Each Row In ThisObject.FixedOffsetOfAdvances Do
		Row.IsFixed = False;
	EndDo;
EndProcedure

&AtClient
Procedure FixedOffsetOfAdvancesBeforeAddRow(Item, Cancel, Clone, Parent, IsFolder, Parameter)
	Cancel = True;
	
	If Not ValueIsFilled(Object.Ref) Then
		Callback = New CallbackDescription("WriteBeforAddNewRow", ThisObject);
		ShowQueryBox(Callback, R().QuestionToUser_001, QuestionDialogMode.YesNo);
	Else
		FixedOffsetOfAdvancesAddRow();
	EndIf;
EndProcedure

&AtClient
Procedure WriteBeforAddNewRow(Result, Params) Export
	If Result = DialogReturnCode.Yes And Write() Then
		FixedOffsetOfAdvancesAddRow();
	EndIf;
EndProcedure

&AtClient
Procedure FixedOffsetOfAdvancesAddRow()
	NewRow = ThisObject.FixedOffsetOfAdvances.Add();
	NewRow.Document = Object.Ref;
	NewRow.Company = Object.Company;
	NewRow.Branch  = Object.Branch;
	NewRow.IsFixed = True;
	Items.FixedOffsetOfAdvances.CurrentRow = NewRow.GetID();
	If Items.FixedOffsetOfAdvances.CurrentRow <> Undefined Then
		Items.FixedOffsetOfAdvances.ChangeRow();
	EndIf;
EndProcedure

&AtServer
Procedure FillFixedOffsetOfAdvances(DocRef)
	If Not ValueIsFilled(DocRef) Then
		Return;
	EndIf;
	
	Query = New Query();
	Query.Text = 
	"SELECT *
	|FROM
	|	InformationRegister.T2018S_FixedOffsetOfAdvances AS T2018S_FixedOffsetOfAdvances
	|WHERE
	|	T2018S_FixedOffsetOfAdvances.Document = &DocRef";
	Query.SetParameter("DocRef", DocRef);
	QueryResult = Query.Execute();
	QuerySelection = QueryResult.Select();
	
	ThisObject.FixedOffsetOfAdvances.Clear();
	
	While QuerySelection.Next() Do
		NewRow = ThisObject.FixedOffsetOfAdvances.Add();
		FillPropertyValues(NewRow, QuerySelection);
	EndDo; 
EndProcedure

&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	DocumentsServer.OnCreateAtServer(Object, ThisObject, Cancel, StandardProcessing);
EndProcedure

&AtClient
Procedure FixedOffsetOfAdvancesAgreementStartChoice(Item, ChoiceData, ChoiceByAdding, StandardProcessing)
	CurrentData = Items.FixedOffsetOfAdvances.CurrentData;
	If CurrentData = Undefined Then
		Return;
	EndIf;
	
	OpenSettings = DocumentsClient.GetOpenSettingsStructure();

	OpenSettings.ArrayOfFilters = New Array();
	OpenSettings.ArrayOfFilters.Add(DocumentsClientServer.CreateFilterItem("DeletionMark", True, DataCompositionComparisonType.NotEqual));
	OpenSettings.ArrayOfFilters.Add(DocumentsClientServer.CreateFilterItem("Kind", PredefinedValue("Enum.AgreementKinds.Standard"), DataCompositionComparisonType.NotEqual));
	
	OpenSettings.FormParameters = New Structure();
	OpenSettings.FormParameters.Insert("Partner"                     , CurrentData.Partner);
	OpenSettings.FormParameters.Insert("IncludeFilterByPartner"      , True);
	OpenSettings.FormParameters.Insert("IncludePartnerSegments"      , True);
	OpenSettings.FormParameters.Insert("IncludeFilterByEndOfUseDate" , False);
	
	OpenSettings.FillingData = New Structure();
	OpenSettings.FillingData.Insert("Partner"   , CurrentData.Partner);
	OpenSettings.FillingData.Insert("LegalName" , CurrentData.LegalName);
	OpenSettings.FillingData.Insert("Company"   , Object.Company);
	DocumentsClient.AgreementStartChoice(Object, ThisObject, Item, ChoiceData, StandardProcessing, OpenSettings);	
EndProcedure

&AtClient
Procedure FixedOffsetOfAdvancesAgreementEditTextChange(Item, Text, StandardProcessing)
	CurrentData = Items.FixedOffsetOfAdvances.CurrentData;
	If CurrentData = Undefined Then
		Return;
	EndIf;
	
	ArrayOfFilters = New Array();
	ArrayOfFilters.Add(DocumentsClientServer.CreateFilterItem("DeletionMark", True, ComparisonType.NotEqual));
	ArrayOfFilters.Add(DocumentsClientServer.CreateFilterItem("Kind", PredefinedValue("Enum.AgreementKinds.Standard"),ComparisonType.NotEqual));
	AdditionalParameters = New Structure();
	AdditionalParameters.Insert("IncludeFilterByEndOfUseDate" , False);
	AdditionalParameters.Insert("IncludeFilterByPartner"      , True);
	AdditionalParameters.Insert("IncludePartnerSegments"      , True);
	AdditionalParameters.Insert("Partner", CurrentData.Partner);
	DocumentsClient.AgreementEditTextChange(Object, ThisObject, Item, Text, StandardProcessing, ArrayOfFilters, AdditionalParameters);
EndProcedure

&AtClient
Procedure SetNewNumber(Command)
	SetNewNumberAtServer();
EndProcedure

&AtServer
Procedure SetNewNumberAtServer()
	If Object.NumeratorRules.IsEmpty() Then
		Object.NumeratorRules = 
			NumberingRulesServer.GetNumeratorGroupForDocument(Object.Ref.Metadata().FullName(), Object.Date);
	EndIf;
	NumberingRulesServer.SetSourceNewNumber(Object);
EndProcedure

#Region COMMANDS

&AtClient
Procedure InternalCommandAction(Command) Export
	InternalCommandsClient.RunCommandAction(Command, ThisObject, Object, Object.Ref);
EndProcedure

&AtClient
Procedure InternalCommandActionWithServerContext(Command) Export
	InternalCommandActionWithServerContextAtServer(Command.Name);
EndProcedure

&AtServer
Procedure InternalCommandActionWithServerContextAtServer(CommandName)
	InternalCommandsServer.RunCommandAction(CommandName, ThisObject, Object, Object.Ref);
EndProcedure

&AtClient
Procedure GeneratedFormCommandActionByName(Command) Export
	ExternalCommandsClient.GeneratedFormCommandActionByName(Object, ThisObject, Command.Name);
	GeneratedFormCommandActionByNameServer(Command.Name);
EndProcedure

&AtServer
Procedure GeneratedFormCommandActionByNameServer(CommandName) Export
	ExternalCommandsServer.GeneratedFormCommandActionByName(Object, ThisObject, CommandName);
EndProcedure

#EndRegion
